app/controllers/api/v1/airlines_controller.rb

SELECT `airlines`.* FROM `airlines`
---
            def index
                airlines = Airline.all

SELECT `airlines`.* FROM `airlines` WHERE `airlines`.`slug` = 'united-airlines' LIMIT 1
---
            def show
                airline = Airline.find_by(slug: params[:slug])

INSERT INTO `airlines` (`name`, `image_url`, `slug`, `created_at`, `updated_at`) VALUES ('United Airlines', 'https://open-flights.s3.amazonaws.com/United-Airlines.png', 'united-airlines', '2021-11-18 20:19:49.974202', '2021-11-18 20:19:49.974202')
---
            def create
                airline = Airline.new(airline_params)
                if airline.save

SELECT `airlines`.* FROM `airlines` WHERE `airlines`.`slug` = 'linha-pipa' LIMIT 1
UPDATE `airlines` SET `airlines`.`name` = 'linha de pipa', `airlines`.`updated_at` = '2021-11-18 20:25:18.770801' WHERE `airlines`.`id` = 14
---
            def update
                airline = Airline.find_by(slug: params[:slug])
                if airline.update(airline_params)

SELECT `airlines`.* FROM `airlines` WHERE `airlines`.`slug` = 'linha-pipa' LIMIT 1
DELETE FROM `airlines` WHERE `airlines`.`id` = 14
---
            def destroy
                airline = Airline.find_by(slug: params[:slug])
                if airline.destroy